In [1]:
import pandas as pd
mark={'name':['harish','rakshitha','manohara','vidya'],
     'maths':[87,98,87,95],
     'itskills':[83,99,84,76]}
df=pd.DataFrame(mark)
display(df)

        name  maths  itskills
0     harish     87        83
1  rakshitha     98        99
2   manohara     87        84
3      vidya     95        76

In [2]:
df.loc[len(df.index)]=['hrutwik',89,96]
df1=df
df1

        name  maths  itskills
0     harish     87        83
1  rakshitha     98        99
2   manohara     87        84
3      vidya     95        76
4    hrutwik     89        96

In [4]:
df.loc[2]=['hrutwik1',89,96]
df

        name  maths  itskills
0     harish     87        83
1  rakshitha     98        99
2   hrutwik1     89        96
3      vidya     95        76
4    hrutwik     89        96